src/cf/InformationRegisters/ПолитикиУчетаСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПолитикиУчетаСерий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолитикаУчетаСерий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолитикаУчетаСерий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПолитикиУчетаСерий/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.КатегорииНоменклатуры) Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
		
		КатегорияВладелец = Параметры.Отбор.Владелец;
		ИспользоватьСерии = КатегорияВладелец.ИспользоватьСерииНоменклатуры;
		ПолитикаУчетаСерий = КатегорияВладелец.ПолитикаУчетаСерий;
		ИспользоватьУникальныеСерии = КатегорияВладелец.ИспользоватьУникальныеСерии;
		ИспользоватьСрокГодностиСерии = КатегорияВладелец.ИспользоватьСрокГодностиСерии;
		ИспользоватьДатуПроизводстваСерии = КатегорияВладелец.ИспользоватьДатуПроизводстваСерии;
		ТочностьУказанияСрокаГодностиСерии = КатегорияВладелец.ТочностьУказанияСрокаГодностиСерии;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", КатегорияВладелец, ВидСравненияКомпоновкиДанных.Равно);
		
		УстановитьДоступностьЭлементовФормы();
		НастройкиПоСкладамСформироватьЗаголовок();
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользоватьСерииПриИзменении(Элемент)
		ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		ФормаВладельца.Объект.ИспользоватьСерииНоменклатуры = ИспользоватьСерии;
		ФормаВладельца.Модифицированность = Истина;
		
		Если Не ИспользоватьСерии Тогда
			ПолитикаУчетаСерий = Неопределено;
		КонецЕсли;
		
		УстановитьДоступностьЭлементовФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолитикаУчетаСерийПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		ФормаВладельца.Объект.ПолитикаУчетаСерий = ПолитикаУчетаСерий;
		ФормаВладельца.Модифицированность = Истина;
		
		УстановитьДоступностьЭлементовФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУникальныеСерииПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		ФормаВладельца.Объект.ИспользоватьУникальныеСерии = ИспользоватьУникальныеСерии;
		ФормаВладельца.Модифицированность = Истина;
		
		УстановитьДоступностьЭлементовФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСрокГодностиСерииПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		ФормаВладельца.Объект.ИспользоватьСрокГодностиСерии = ИспользоватьСрокГодностиСерии;
		ФормаВладельца.Модифицированность = Истина;
		
		УстановитьДоступностьЭлементовФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДатуПроизводстваСерииПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		ФормаВладельца.Объект.ИспользоватьДатуПроизводстваСерии = ИспользоватьДатуПроизводстваСерии;
		ФормаВладельца.Модифицированность = Истина;
		
		УстановитьДоступностьЭлементовФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьУказанияСрокаГодностиСерииПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		ФормаВладельца.Объект.ТочностьУказанияСрокаГодностиСерии = ТочностьУказанияСрокаГодностиСерии;
		ФормаВладельца.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолитикаУчетаСерий", "Доступность", ИспользоватьСерии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИспользоватьСерии", "Доступность", ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолитикаУчетаСерий", "Доступность", ИспользоватьСерии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолитикаУчетаСерий", "АвтоОтметкаНезаполненного", ИспользоватьСерии);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочностьУказанияСрокаГодностиСерии", "Доступность", ИспользоватьСерии И (ИспользоватьСрокГодностиСерии Или ИспользоватьДатуПроизводстваСерии));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаФлажки", "Доступность", ИспользоватьСерии);
	
КонецПроцедуры

&НаСервере
Процедура НастройкиПоСкладамСформироватьЗаголовок()
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", КатегорияВладелец);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПолитикиУчетаСерий.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий
	|ИЗ
	|	РегистрСведений.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|ГДЕ
	|	ПолитикиУчетаСерий.Владелец = &Владелец";
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Элементы.ГруппаНастройкиПолитики.Заголовок = НСтр("ru = 'Индивидуальные настройки по складам (Да)'");
	Иначе
		Элементы.ГруппаНастройкиПолитики.Заголовок = НСтр("ru = 'Индивидуальные настройки по складам (Нет)'");
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
